Pandas-DataFrame and Series

Pandas is a powerful data manipulation library in Python,widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional,size-mutable, and potentially hetrogeneous tabular data structure with labelled axes(rows and columns).

## Series

A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

In [4]:
import pandas as pd

data=[1,2,3,4,5]
series=pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

Create a Series from dictionary

In [5]:
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [7]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index)

a    10
b    20
c    30
dtype: int64

## DataFrame

Create a DataFrame from a dictionary of list.

In [9]:
data={
    'Name':['Chetana','Arya','Talat'],
    'Age':[25,38,45],
    'City':['abc','cfv','ghf']
}
dataframe=pd.DataFrame(data)
print(dataframe)
print(type(dataframe))

      Name  Age City
0  Chetana   25  abc
1     Arya   38  cfv
2    Talat   45  ghf
<class 'pandas.core.frame.DataFrame'>

In [10]:
import numpy as np
np.array(dataframe)

array([['Chetana', 25, 'abc'],
       ['Arya', 38, 'cfv'],
       ['Talat', 45, 'ghf']], dtype=object)

Create a Data Frame from a list of dictionaries

In [11]:
data=[
    {'Name':'Chetana','Age':21,'City':'Pune'},
    {'Name':'Cheta','Age':22,'City':'Pune'},
    {'Name':'Chetan','Age':31,'City':'Nagpur'},
    {'Name':'Chetaa','Age':11,'City':'Pune'},
    {'Name':'Chetna','Age':21,'City':'Mumbai'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age    City
0  Chetana   21    Pune
1    Cheta   22    Pune
2   Chetan   31  Nagpur
3   Chetaa   11    Pune
4   Chetna   21  Mumbai
<class 'pandas.core.frame.DataFrame'>

In [14]:

df=pd.read_csv("students.csv")

In [15]:
df.head(5)

   StudentID      Name  Age
0          1  Pranjali   21
1          2   Anamika   23
2          3     Talat   21
3          4      Yami   20
4          5   Chetana   22

In [16]:
df.tail(5)

   StudentID      Name  Age
0          1  Pranjali   21
1          2   Anamika   23
2          3     Talat   21
3          4      Yami   20
4          5   Chetana   22

Accessing data from dataframe

In [18]:
df

   StudentID      Name  Age
0          1  Pranjali   21
1          2   Anamika   23
2          3     Talat   21
3          4      Yami   20
4          5   Chetana   22

In [20]:
df['StudentID']

0    1
1    2
2    3
3    4
4    5
Name: StudentID, dtype: int64

In [21]:
df.loc[0]  #If i want to go with the row index that time ill use this

StudentID           1
Name         Pranjali
Age                21
Name: 0, dtype: object

In [22]:
df.iloc[0] #column index

StudentID           1
Name         Pranjali
Age                21
Name: 0, dtype: object

In [24]:
df.loc[1][1]

C:\Users\cheta\AppData\Local\Temp\ipykernel_4560\496146328.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[1][1]

'Anamika'

In [25]:
df.iloc[0][0]

C:\Users\cheta\AppData\Local\Temp\ipykernel_4560\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

1

Accessing a specified element

In [26]:
df['Name']

0    Pranjali
1     Anamika
2       Talat
3        Yami
4     Chetana
Name: Name, dtype: object

In [27]:
df.at[1,'Age']

23

In [28]:
df.at[2,'Age']

21

Accessing a specified element using iat

In [29]:
df.iat[2,2]

21

In [30]:
df

   StudentID      Name  Age
0          1  Pranjali   21
1          2   Anamika   23
2          3     Talat   21
3          4      Yami   20
4          5   Chetana   22

Data manipulation with DataFrame

In [31]:
df['Salary']=[50000,60000,50000,40000,30000]

In [32]:
df

   StudentID      Name  Age  Salary
0          1  Pranjali   21   50000
1          2   Anamika   23   60000
2          3     Talat   21   50000
3          4      Yami   20   40000
4          5   Chetana   22   30000

Remove a Column

axis=0 for row and axis=1 for column

inplace=true...it will permanently delete that column

In [39]:
df.drop('Salary',axis=1,inplace=True)

In [40]:
df

   StudentID      Name  Age
0          1  Pranjali   21
1          2   Anamika   23
2          3     Talat   21
3          4      Yami   20
4          5   Chetana   22

Add age to column

In [43]:
df["Age"]=df['Age']+1
df

   StudentID      Name  Age
0          1  Pranjali   25
1          2   Anamika   27
2          3     Talat   25
3          4      Yami   24
4          5   Chetana   26

In [45]:
df.drop(0,inplace=True)

In [46]:
df

   StudentID     Name  Age
1          2  Anamika   27
2          3    Talat   25
3          4     Yami   24
4          5  Chetana   26

Display the data types of each column

In [47]:
print("Data Types: \n",df.dtypes)

Data Types:
 StudentID     int64
Name         object
Age           int64
dtype: object

Describe the DataFrame

In [48]:
print("Statistical Summary: \n",df.describe())

Statistical Summary:
        StudentID        Age
count   4.000000   4.000000
mean    3.500000  25.500000
std     1.290994   1.290994
min     2.000000  24.000000
25%     2.750000  24.750000
50%     3.500000  25.500000
75%     4.250000  26.250000
max     5.000000  27.000000